app/controllers/songs_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2017-09-20 06:54:47.804438"], ["updated_at", "2017-09-20 06:54:47.804438"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 1], ["created_at", "2017-09-20 06:54:47.829312"], ["updated_at", "2017-09-20 06:54:47.829312"]]
---
  def upload
    CSV.foreach(params[:file].path, headers: true) do |file|
      Song.create(title: lead[0], artist_name: lead[1])